In [1]:
import pandas as pd
import numpy as np

In [13]:
cols = ['user_id', 'movie_id', 'rating']

dataset = pd.read_csv('data/ml-100k/u.data', sep='\t', names=cols, usecols=range(3))

In [14]:
dataset.head()

   user_id  movie_id  rating
0        0        50       5
1        0       172       5
2        0       133       1
3      196       242       3
4      186       302       3

In [15]:
dataset.tail()

        user_id  movie_id  rating
99998       880       476       3
99999       716       204       5
100000      276      1090       1
100001       13       225       2
100002       12       203       3

In [18]:
m = dataset.groupby('movie_id').agg({'rating' : [np.size, np.mean]})

In [20]:
m.head()

         rating
           size      mean
movie_id
1           452  3.878319
2           131  3.206107
3            90  3.033333
4           209  3.550239
5            86  3.302326